#สร้างไฟล์ใหม่ใน FOLDER /assignments/week09/
#lab-assignment-1109.py

#เครื่องคำนวณค่าไฟฟ้าแบบขั้นบันได
#เขียนโปรแกรมคำนวณค่าไฟฟ้าจากจำนวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น
#โดยใช้ฟังก์ชัน calculate_electricity_cost(units)

#ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
#จำนวนหน่วยที่ใช้    อัตราต่อหน่วย
#1-50 หน่วยแรก       2.50 บาท
#51-100 หน่วย        3.00 บาท
#101-200 หน่วย       3.50 บาท
#มากกว่า 200 หน่วย   4.00 บาท

#ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน

#เงื่อนไข
#โปรแกรมแสดงเมนูซ้ำ
#ผู้ใช้เลือก 1 เพื่อคำนวณค่าไฟ
#ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
#หากเลือกเมนูอื่น ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
#จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ
#ให้แสดงรายละเอียดค่าไฟแต่ละช่วง และยอดรวมสุทธิ

#ตัวอย่างหน้าจอ

#===== โปรแกรมคำนวณค่าไฟฟ้า =====

#1. คำนวณค่าไฟ
#2. ออกจากโปรแกรม


def calculate_electricity_cost(units):
    if units > 200:
        cost = (2.50 * 50) + (3.00 * 50) + (3.50 * 100) + (4.00 * (units - 200)) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย: 150.00 บาท")
        print("101-200 หน่วย: 350.00 บาท")
        print(f"201-{units} หน่วย: {4.00 * (units - 200)} บาท")
        print("ค่าบริการ 25.00 บาท")
        print("รวมค่าไฟทั้งสิ้น:", cost, "บาท")

    elif units > 100:
        cost = (2.50 * 50) + (3.00 * 50) + (3.50 * (units - 100)) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print("51-100 หน่วย: 150.00 บาท")
        print(f"101-{units} หน่วย: {3.50 * (units - 100)} บาท")
        print("ค่าบริการ 25.00 บาท")
        print(units, "units =", cost, "THB")

    elif units > 50:
        cost = (2.50 * 50) + (3.00 * (units - 50)) + 25
        print("1-50 หน่วย: 125.00 บาท")
        print(f"51-{units} หน่วย: {3.00 * (units - 50)} บาท")
        print("ค่าบริการ 25.00 บาท")
        print(units, "units =", cost, "THB")

    elif units > 0:
        cost = (2.50 * units) + 25
        print(f"1-{units} หน่วย: {2.50 * units} บาท")
        print("ค่าบริการ 25.00 บาท")
        print(units, "units =", cost, "THB")